using System.Reflection;
using System.Resources;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;
using System.Windows;

// РћР±С‰РёРµ СЃРІРµРґРµРЅРёСЏ РѕР± СЌС‚РѕР№ СЃР±РѕСЂРєРµ РїСЂРµРґРѕСЃС‚Р°РІР»СЏСЋС‚СЃСЏ СЃР»РµРґСѓСЋС‰РёРј РЅР°Р±РѕСЂРѕРј
// РЅР°Р±РѕСЂ Р°С‚СЂРёР±СѓС‚РѕРІ. РР·РјРµРЅРёС‚Рµ Р·РЅР°С‡РµРЅРёСЏ СЌС‚РёС… Р°С‚СЂРёР±СѓС‚РѕРІ, С‡С‚РѕР±С‹ РёР·РјРµРЅРёС‚СЊ СЃРІРµРґРµРЅРёСЏ,
// СЃРІСЏР·Р°РЅРЅС‹Рµ СЃРѕ СЃР±РѕСЂРєРѕР№.
[assembly: AssemblyTitle("ServiceCenter")]
[assembly: AssemblyDescription("")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("")]
[assembly: AssemblyProduct("ServiceCenter")]
[assembly: AssemblyCopyright("Copyright (c) 2025")]
[assembly: AssemblyTrademark("")]
[assembly: AssemblyCulture("")]

// РЈСЃС‚Р°РЅРѕРІРєР° Р·РЅР°С‡РµРЅРёСЏ False РґР»СЏ РїР°СЂР°РјРµС‚СЂР° ComVisible РґРµР»Р°РµС‚ С‚РёРїС‹ РІ СЌС‚РѕР№ СЃР±РѕСЂРєРµ РЅРµРІРёРґРёРјС‹РјРё
// РґР»СЏ РєРѕРјРїРѕРЅРµРЅС‚РѕРІ COM. Р•СЃР»Рё РЅРµРѕР±С…РѕРґРёРјРѕ РѕР±СЂР°С‚РёС‚СЊСЃСЏ Рє С‚РёРїСѓ РІ СЌС‚РѕР№ СЃР±РѕСЂРєРµ С‡РµСЂРµР·
// РёР· РјРѕРґРµР»Рё COM, СѓСЃС‚Р°РЅРѕРІРёС‚Рµ Р°С‚СЂРёР±СѓС‚ ComVisible РґР»СЏ СЌС‚РѕРіРѕ С‚РёРїР° РІ Р·РЅР°С‡РµРЅРёРµ true.
[assembly: ComVisible(false)]

//Р§С‚РѕР±С‹ РЅР°С‡Р°С‚СЊ СЃРѕР·РґР°РЅРёРµ Р»РѕРєР°Р»РёР·СѓРµРјС‹С… РїСЂРёР»РѕР¶РµРЅРёР№, Р·Р°РґР°Р№С‚Рµ
//<UICulture>CultureYouAreCodingWith</UICulture> РІ С„Р°Р№Р»Рµ .csproj
//РІ <PropertyGroup>. РќР°РїСЂРёРјРµСЂ, РїСЂРё РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРё Р°РЅРіР»РёР№СЃРєРѕРіРѕ (РЎРЁРђ)
//РІ СЃРІРѕРёС… РёСЃС…РѕРґРЅС‹С… С„Р°Р№Р»Р°С… СѓСЃС‚Р°РЅРѕРІРёС‚Рµ <UICulture> РІ en-US.  Р—Р°С‚РµРј РѕС‚РјРµРЅРёС‚Рµ РїСЂРµРѕР±СЂР°Р·РѕРІР°РЅРёРµ РІ РєРѕРјРјРµРЅС‚Р°СЂРёР№
//Р°С‚СЂРёР±СѓС‚Р° NeutralResourceLanguage РЅРёР¶Рµ.  РћР±РЅРѕРІРёС‚Рµ "en-US" РІ
//СЃС‚СЂРѕРєР° РІРЅРёР·Сѓ РґР»СЏ РѕР±РµСЃРїРµС‡РµРЅРёСЏ СЃРѕРѕС‚РІРµС‚СЃС‚РІРёСЏ РЅР°СЃС‚СЂРѕР№РєРё UICulture РІ С„Р°Р№Р»Рµ РїСЂРѕРµРєС‚Р°.

//[assembly: NeutralResourcesLanguage("en-US", UltimateResourceFallbackLocation.Satellite)]


[assembly: ThemeInfo(
    ResourceDictionaryLocation.None, //РіРґРµ СЂР°СЃРїРѕР»РѕР¶РµРЅС‹ СЃР»РѕРІР°СЂРё СЂРµСЃСѓСЂСЃРѕРІ РїРѕ РєРѕРЅРєСЂРµС‚РЅС‹Рј С‚РµРјР°С‚РёРєР°Рј
                                     //(РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ, РµСЃР»Рё СЂРµСЃСѓСЂСЃ РЅРµ РЅР°Р№РґРµРЅ РЅР° СЃС‚СЂР°РЅРёС†Рµ,
                                     // РёР»Рё РІ СЃР»РѕРІР°СЂСЏС… СЂРµСЃСѓСЂСЃРѕРІ РїСЂРёР»РѕР¶РµРЅРёСЏ)
    ResourceDictionaryLocation.SourceAssembly //РіРґРµ СЂР°СЃРїРѕР»РѕР¶РµРЅ СЃР»РѕРІР°СЂСЊ СѓРЅРёРІРµСЂСЃР°Р»СЊРЅС‹С… СЂРµСЃСѓСЂСЃРѕРІ
                                              //(РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ, РµСЃР»Рё СЂРµСЃСѓСЂСЃ РЅРµ РЅР°Р№РґРµРЅ РЅР° СЃС‚СЂР°РЅРёС†Рµ,
                                              // РІ РїСЂРёР»РѕР¶РµРЅРёРё РёР»Рё РІ РєР°РєРёС…-Р»РёР±Рѕ СЃР»РѕРІР°СЂСЏС… СЂРµСЃСѓСЂСЃРѕРІ РґР»СЏ РєРѕРЅРєСЂРµС‚РЅРѕР№ С‚РµРјС‹)
)]


// РЎРІРµРґРµРЅРёСЏ Рѕ РІРµСЂСЃРёРё РґР»СЏ СЃР±РѕСЂРєРё РІРєР»СЋС‡Р°СЋС‚ С‡РµС‚С‹СЂРµ СЃР»РµРґСѓСЋС‰РёС… Р·РЅР°С‡РµРЅРёСЏ:
//
//      РћСЃРЅРѕРІРЅРѕР№ РЅРѕРјРµСЂ РІРµСЂСЃРёРё
//      Р”РѕРїРѕР»РЅРёС‚РµР»СЊРЅС‹Р№ РЅРѕРјРµСЂ РІРµСЂСЃРёРё
//      РќРѕРјРµСЂ СЃР±РѕСЂРєРё
//      РќРѕРјРµСЂ СЂРµРґР°РєС†РёРё
//
[assembly: AssemblyVersion("1.0.0.0")]
[assembly: AssemblyFileVersion("1.0.0.0")]
